[
    {
        "URL": "https://ericdev1o.github.io/OC900_p2_RidingCities/",
        "repository": "https://github.com/ericDev1o/OC900_p2_RidingCities",
        "fileName": "riding+cities.webp",
        "number": 2,
        "title": "Riding cities, découvrez le skateboard près de chez vous",
        "contexte": "Dans le cadre de la mise à jour du contenu du site web de l’association sportive Riding Cities, il s’agissait d’enrichir le contenu tout en respectant l’identité visuelle existante. Le défi principal était de rester fidèle à la maquette Figma proposée, tout en assurant une bonne expérience utilisateur.",
        "objectifs": "Ajouter une section présentant les membres fondateurs avec photos et noms, ainsi qu’une zone de téléchargement des plannings pour différents groupes. Maintenir une structure HTML sémantique et appliquer rigoureusement les styles déjà définis.",
        "stackTechnique": "HTML5 pour la structure, CSS existant pour le style, Visual Studio Code comme environnement de développement, et Figma pour le design.",
        "competencesDeveloppees": "Maîtrise de la structuration HTML sémantique, adaptation de styles CSS en se basant sur un design existant, et lecture attentive de maquettes pour une correspondance précise.",
        "resultatsEtImpact": "Mise en ligne d’une nouvelle section visuellement cohérente intégrée au site, avec boutons fonctionnels pour le téléchargement des plannings, améliorant l’information disponible pour les membres. Le rendu respecte fidèlement la charte graphique.",
        "perspectivesAmelioration": "Rendre le site web 'responsive' pour l’adapter aux petits écrans jusqu'à 320 pixels de large. Ajout d’éléments pour améliorer l’expérience utilisateur, notamment en termes d’accessibilité.",
        "logos": ["HTML", "gitHub"]
    },
    {
        "URL": "https://ericdev1o.github.io/OC900_p3_Booki/",
        "repository": "https://github.com/ericDev1o/OC900_p3_Booki",
        "fileName": "booki.webp",
        "number": 3,
        "title": "Booki, trouvez votre hébergement vacancier de rêve",
        "contexte": "Ce projet de formation simule une situation professionnelle visant à créer un site web pour une agence de voyages. L’enjeu principal était de présenter clairement logements et activités touristiques afin d’inciter les visiteurs à effectuer une réservation. Le design devait rester simple et efficace pour une bonne lisibilité.",
        "objectifs": "Reproduire fidèlement la maquette visuelle du site afin de garantir une expérience utilisateur conforme aux attentes. Il s’agissait aussi d’assurer une mise en page 'responsive' et fluide pour une navigation agréable sur tous les écrans.",
        "stackTechnique": "Le projet a été réalisé avec HTML et CSS, en mettant particulièrement l’accent sur Flexbox pour gérer la mise en page. Ces technologies ont permis de respecter précisément la structure visuelle et d’assurer un rendu 'responsive'.",
        "competencesDeveloppees": "Ce projet m’a permis de renforcer mes compétences en intégration HTML/CSS, notamment dans l’utilisation avancée de Flexbox. J’ai aussi appris à adapter un design statique de maquette en un site web fonctionnel fidèle à l’original.",
        "resultatsEtImpact": "Le site Booki a été livré conforme à la maquette, avec une mise en page 'responsive' assurant une bonne expérience sur différents appareils. Ce projet a validé mes capacités à livrer un site esthétique et fonctionnel fidèle aux attentes du client fictif.",
        "perspectivesAmelioration": "À l’avenir, j’envisage d’ajouter des interactions dynamiques pour enrichir l’expérience utilisateur. Améliorer l’accessibilité du site afin de le rendre utilisable par un plus large public augmentera la qualité perçue du projet.",
        "logos": ["HTML", "CSS", "gitHub"]
    },
    {
        "URL": "https://ericdev1o.github.io/OC900_p4_OhMyFood/",
        "repository": "https://github.com/ericDev1o/OC900_p4_OhMyFood",
        "fileName": "oh+my+food.webp",
        "number": 4,
        "title": "OhMyFood, précommandez vos menus",
        "contexte": "Ce projet consiste à créer un site web 'responsive' présentant les menus de quatre restaurants. L’objectif était de concevoir une interface attractive avec des animations pour valoriser les plats proposés.",
        "objectifs": "Réaliser un site dynamique et fluide, intégrant des animations pour enrichir l’expérience utilisateur tout en assurant une bonne adaptabilité sur différents supports.",
        "stackTechnique": "Le site a été développé en HTML, CSS et SCSS, permettant une meilleure organisation et maintenance du code grâce au préprocesseur Sass.",
        "competencesDeveloppees": "J’ai approfondi mes connaissances en structuration CSS avec Sass et renforcé mes capacités de résolution des problèmes liés aux animations et à la 'responsivité'.",
        "resultatsEtImpact": "Le site final offre une présentation dynamique et attrayante des menus, accessible sur divers appareils. Cette réalisation témoigne de ma capacité à créer des interfaces fonctionnelles et visuellement engageantes.",
        "perspectivesAmelioration": "L’accessibilité du site peut être optimisée pour garantir une meilleure expérience à tous les utilisateurs, notamment via le clavier et les lecteurs d’écran.",
        "logos": ["HTML", "CSS", "SCSS", "gitHub"]
    },
    {
        "URL": "https://ericdev1o.github.io/OC900_p5_Print-it-JS/",
        "repository": "https://github.com/ericDev1o/OC900_p5_Print-it-JS",
        "fileName": "print+it.webp",
        "number": 5,
        "title": "Print it! Vos impressions de qualité",
        "contexte": "Développement du site web d’une petite imprimerie familiale souhaitant moderniser sa présence en ligne. Le défi principal était de passer d’un site statique à une interface plus interactive tout en respectant la charte graphique de la maquette.",
        "objectifs": "Créer un carrousel d’images dynamique pour présenter les services, tout en assurant une navigation fluide et intuitive. Garantir la fidélité visuelle par rapport à la maquette originale et une expérience utilisateur optimisée.",
        "stackTechnique": "HTML et CSS pour la structure et le design, JavaScript pour l’interactivité via la gestion des événements. Visual Studio Code utilisé comme environnement de développement, avec GitHub pour le versionnage.",
        "competencesDeveloppees": "Manipulation du DOM en JavaScript, mise en place d’écouteurs d’événements, gestion rigoureuse des différentes situations de navigation dans le carrousel. Apprentissage de la coordination entre code statique et dynamique. Réalisme focalisé sur une fonctionnalité assez juste à temps.",
        "resultatsEtImpact": "Un carrousel fonctionnel, conforme à la maquette, qui améliore l’attractivité du site. Le projet a renforcé la réactivité du site qui appelle plus à l'action.",
        "perspectivesAmelioration": "Compléter le 'responsive', intégration de fonctionnalité supplémentaire comme le défilement automatique. Automatisation des tests pour couvrir tous les cas d’utilisation possibles sans régression même dans un délai contraint. Amélioration de la performance en optimisant le chargement des images.",
        "logos": ["HTML", "CSS", "JS", "gitHub"]
    },
     {
        "URL": "https://ericdev1o-oc900-p7-kasa.netlify.app/",
        "repository": "https://github.com/ericDev1o/OC900_p7_kasa",
        "fileName": "kasa.webp",
        "number": 7,
        "title": "Kasa, votre agence immobilière ",
        "contexte": "Le site Kasa est une plateforme web professionnelle pour une agence immobilière, où la présentation visuelle des logements est cruciale pour inciter à la réservation. Il devait s’adapter à un contenu variable en nombre de photos et en longueur de texte.",
        "objectifs": "Créer un site web 'responsive', accessible, capable de gérer efficacement différents contenus variés tout en offrant une expérience fluide et engageante.",
        "stackTechnique": "Le projet a été développé avec HTML, CSS, TypeScript, Vite, React et React Router, assurant une architecture moderne et performante.",
        "competencesDeveloppees": "Ce projet m’a permis de développer ma rigueur en structurant un projet React de zéro selon les bonnes pratiques.",
        "resultatsEtImpact": "Le site 'responsive' affiche tous les logements, avec une animation attrayante lors du changement de photo dans le carrousel, améliorant l’expérience utilisateur.",
        "perspectivesAmelioration": "L’accessibilité du site reste un axe de progression pour garantir une expérience inclusive à tous les utilisateurs. Résolution de problèmes et gestion du temps d'apprentissage de React peuvent être améliorés.",
        "logos": ["HTML", "CSS", "TS", "react", "reactRouter", "vite", "gitHub"]
    },
    {
        "URL": "https://ericdev1o.github.io/OC900_p8_ninacarducci.github.io/",
        "repository": "https://github.com/ericDev1o/OC900_p8_ninacarducci.github.io",
        "fileName": "nina+carducci.webp",
        "number": 8,
        "title": "Nina Carducci, votre photographe",
        "contexte": "Ce projet consiste à concevoir un site web professionnel pour la photographe Nina Carducci, avec un fort enjeu d’optimisation pour le référencement naturel (Search Engine Optimization).",
        "objectifs": "Développer un site optimisé SEO Lighthouse à plus de 90/100 dans chaque catégorie, rapide à charger et bien positionné sur les moteurs de recherche, tout en offrant une bonne visibilité sur les plateformes comme Google Maps et X.",
        "stackTechnique": "Le projet utilise HTML, CSS, ainsi que des outils d’analyse SEO tels que Lighthouse, GTmetrix et WAvE pour évaluer les performances et l’accessibilité dans une fenêtre de navigatio privée.",
        "competencesDeveloppees": "Ce projet m’a permis de travailler avec rigueur la rédaction d’un cahier d’analyse SEO et l’utilisation d’outils d’audit pour améliorer les performances du site mobile.",
        "resultatsEtImpact": "Le site affiche un score Lighthouse > 90, se charge en moins de 2 secondes et bénéficie d’une visibilité améliorée sur Google Maps, Facebook et X, favorisant un bon référencement.",
        "perspectivesAmelioration": "Des améliorations en matière d’accessibilité sont envisageables pour garantir une meilleure expérience à tous les utilisateurs, notamment les préférences de mouvement et clignotement plus longs.",
        "logos": ["HTML", "CSS", "lighthouse", "GTmetrix", "WAvE", "gitHub"]
    },
    {
        "URL": "https://ericdev1o-oc900-p10-argent-bank-front.netlify.app/",
        "repository": "https://github.com/ericDev1o/OC900_p10_ArgentBank-Frontend",
        "fileName": "argent+bank.webp",
        "number": 10,
        "title": "ArgentBank, votre nouvelle banque",
        "contexte": "ArgentBank est une nouvelle banque en ligne proposant une interface ergonomique et sécurisée pour ses utilisateurs.",
        "objectifs": "Concevoir une application web modulaire et évolutive, offrant une expérience utilisateur fluide tout en garantissant la sécurité des données.",
        "stackTechnique": "HTML, CSS, TypeScript, React, React Router, Redux, Vite et Jest pour les tests ont rendu ce projet plus réalisable. Lighthouse et WAvE assurent le respect des bonne pratiques par l’analyse des performances et de l’accessibilité.",
        "competencesDeveloppees": "J’ai approfondi mes pratiques d'organisation logicielle en structurant un code modulaire avec un store Redux centralisé pour une gestion d’état efficace.",
        "resultatsEtImpact": "Le site propose un intranet performant grâce à Redux, facilitant la gestion des connexions utilisateurs et offrant une navigation fluide.",
        "perspectivesAmelioration": "Des optimisations de performances restent envisageables pour améliorer la rapidité et la réactivité de l’application. La sécurité doit être 'by design' aussi",
        "logos": ["HTML", "CSS", "TS", "react", "reactRouter", "redux", "vite", "jest", "lighthouse", "WAvE", "gitHub"]
    },
    {
        "URL": "https://www.notion.so/2771378a02f28087addbeed4e8a449d4?v=2771378a02f281a08ff6000c17a46212&source=copy_link",
        "repository": "https://github.com/ericDev1o/OC900_p11_menu-maker",
        "fileName": "menu+maker.webp",
        "number": 11,
        "title": "Menu Maker par Qwenta, vos menus édités et partagés",
        "contexte": "Développement d’un site web d’édition de menus pour les restaurateurs, intégré à l’écosystème Deliveroo, afin de faciliter la gestion et la livraison des commandes. Le projet s’inscrit dans l’offre d’une imprimerie souhaitant diversifier ses services numériques.",
        "objectifs": "Planifier le développement d'une interface intuitive pour que les restaurateurs puissent facilement concevoir et modifier leurs menus. Structurer la planification via un tableau Kanban et mettre en place une veille technologique ciblée pour identifier les solutions techniques adaptées tout en maîtrisant les délais et la qualité du développement.",
        "stackTechnique": "HTML, CSS, TypeScript, react pour le frontend prévu, Notion Kanban pour la gestion de projet, Feedly pour la veille technologique, et excalidraw pour les diagrammes collaboratifs. Git est utilisé pour le versionnage du code.",
        "competencesDeveloppees": "Estimation agile des tâches malgré des maquettes imparfaites, collaboration en équipes distinctes frontend/backend, modélisation des cas d’usage et séquences, et maîtrise du travail en équipe agile avec une transparence totale via git.",
        "resultatsEtImpact": "Mise en place d’un processus clair avec un découpage technique efficace, réduction des risques liés à l’absentéisme grâce au partage de la documentation et au versionnage, améliorant la réactivité et la robustesse du projet.",
        "perspectivesAmelioration": "Renforcer la validation des maquettes avant développement pour éviter les oublis, automatiser le déploiement continu, et étendre la veille technologique pour anticiper les évolutions futures du marché des livraisons et interfaces.",
        "logos": ["feedly", "notion", "excalidraw", "gitHub"]
    },
    {
        "URL": "https://ericdev1o.github.io/OC900_p12_portfolio/",
        "repository": "https://github.com/ericDev1o/OC900_p12_portfolio",
        "fileName": "portfolio.webp",
        "number": 12,
        "title": "portfolio",
        "contexte": "Réalisation d’un site vitrine professionnel pour mettre en avant des services, avec une planification agile et un développement full-code. Le défi principal était de concilier fonctionnalité, accessibilité et performances tout en respectant des délais aussi réalistes que possible.",
        "objectifs": "Créer un site simple mais attractif avec des animations douces et un appel au contact efficace. Assurer une accessibilité optimale et de bonnes performances, tout en validant la qualité via des outils de test automatisés et manuels.",
        "stackTechnique": "HTML, CSS, TypeScript, React, TailwindCSS, rendu côté client poussé grâce aux outils d’analyse tels que Lighthouse, pa11y, axe Dev Tools, ainsi que Notion Kanban pour la gestion agile.",
        "competencesDeveloppees": "Découpage frontend en composants react, accessibilité solide et performances en progrès. Début opérationnel d'automatisation des tests avec vitest-axe et stylelint.",
        "resultatsEtImpact": "Livraison d’une version 0.1.2 fonctionnelle respectant les standards, avec une amélioration notable de l’accessibilité et des performances mesurées par Lighthouse.",
        "perspectivesAmelioration": "1) Faire adhérer le bas de page au défilement, 2) supprimer les marges blanches au défilement de 320 à 1440 px, 3) proposer un carrousel de projets, 4) différencier l'affichage selon mobile / tablette ou desktop, 5) filtrer les projets par technologie, 6) publier une vidéo a) de la présentation à propos voire b) des projets passés sont soumises au sondage entre pairs pour décision / priorisation.",
        "logos": ["HTML", "CSS", "TS", "tailwindCSS", "react", "lighthouse", "WAvE", "axeDevTool", "greenITanalysis", "feedly", "stylelint", "pa11y", "vitestAxe", "notion", "gitHub"]
    }
]